Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьОНецелыхМестах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЕдиницыИзмерения/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Перем БазоваяЕдиницаНоменклатурыНаименование;

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если НЕ ЭтоЕдиницаИзмеренияНоменклатуры Тогда
        Возврат;
	КонецЕсли;	
	
	ДоступностьПорогаОкругления = (ЗначениеЗаполнено(Объект.Владелец) И БазоваяЕдиницаНоменклатуры <> Объект.ЕдиницаПоКлассификатору);
	
	Элементы.ПорогОкругления.Доступность = ДоступностьПорогаОкругления;
    Элементы.ПредупреждатьОНецелыхМестах.Доступность = ДоступностьПорогаОкругления;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформационныеНадписи()
	
	Если Объект.ПорогОкругления = 0 Тогда
		Элементы.ИнформацияОбОкруглении.Заголовок = "(в сторону уменьшения)";
	Иначе
	    Элементы.ИнформацияОбОкруглении.Заголовок = "("+Объект.ПорогОкругления+" "+ БазоваяЕдиницаНоменклатурыНаименование +" и более = 1 "+СокрЛП(Объект.Наименование)+")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Объект.Наименование = Строка(Объект.ЕдиницаПоКлассификатору);
	
	УстановитьДоступность();
	Если ЗначениеЗаполнено(Объект.Владелец) И БазоваяЕдиницаНоменклатуры = Объект.ЕдиницаПоКлассификатору Тогда
		Объект.ПорогОкругления = 0;
		Объект.ПредупреждатьОНецелыхМестах = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорогОкругленияПриИзменении(Элемент)
	
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Если Объект.Коэффициент = 0 Тогда
			Объект.Коэффициент = 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаПоКлассификатору) Тогда
			Объект.ЕдиницаПоКлассификатору = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяЕдиницаПоКлассификатору");
		КонецЕсли;
	//+++АК CISA 2018.11.07 ИП-00020196	
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		КолвоЕИ = Справочники.ЕдиницыИзмерения.ВернутьКолвоЕИ(Объект.Владелец);
		Если КолвоЕИ <> 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя добавить более одной единицы измерения!";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	//---АК CISA
	КонецЕсли;
	
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
		Элементы.Вес.Заголовок = "Вес (" + СокрЛП(ЕдиницаИзмеренияВеса)+")";
	КонецЕсли;

	//ЕдиницаИзмеренияОбъема = Константы.ЕдиницаИзмеренияОбъема.Получить();
	//Если ЗначениеЗаполнено(ЕдиницаИзмеренияОбъема) Тогда
	//	Элементы.Объем.Заголовок = "Объем (" + СокрЛП(ЕдиницаИзмеренияОбъема) +")";
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
    	БазоваяЕдиницаНоменклатуры = Объект.Владелец.БазоваяЕдиницаИзмерения;
		БазоваяЕдиницаНоменклатурыНаименование = СокрЛП(БазоваяЕдиницаНоменклатуры);
		Элементы.Коэффициент.Заголовок = "Содержит (" + БазоваяЕдиницаНоменклатурыНаименование +")";
	КонецЕсли;
	
	ЭтоЕдиницаИзмеренияНоменклатуры = (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура"));
	
	Если НЕ ЭтоЕдиницаИзмеренияНоменклатуры Тогда
		Элементы.ПорогОкругления.Видимость = ложь;
		Элементы.ИнформацияОбОкруглении.Видимость = ложь;
		Элементы.ПредупреждатьОНецелыхМестах.Видимость = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры
